clear, clc
 
N =10; % количество узлов в сетке;
t_end = 60; %окончание по времени;
L = 0.1; %длина толщены пластинки;
lamba = 46; %коэффициент теплопроводности;
ro = 7800; % плотность;
c = 460; %теплоемкость;
T0 = 20; %начальная температура;
T1 = 300; % температура на границе x=0);
Tr = 100; %температура на границе x=L ;
 
T = zeros(1,N);
alfa = zeros(1,N);
beta = zeros(1,N);
 
h = L/(N-1); % определяем расчетный шаг сетки по пространственной координате
tau = t_end/100; %определяем расчетный шаг сетки по времени
 
for i=1:N
    T(i)= T0;
    time = 0;
    
    while time < t_end
        time = time + tau;
        alfa(1) = 0;
        beta(1) = T1;
        
        for j=2:N-1
            ai = lamba/(h^2);
            bi = 2*lamba/(h^2)+ro*c/tau;
            ci = lamba/(h^2);
            fi = -ro*c*T(j)/tau;
            alfa(j) = ai/(bi-ci*alfa(j-1)); % прогоночные коэффициенты
            beta(j) = (ci*beta(j-1)-fi)/(bi-ci*alfa(j-1));% прогоночные коэффициенты
        end
        
        T(N) = Tr; %определяем значение температуры на правой границе
        
        for k = N-1:-1:1
            T(k)= alfa(k)*T(k+1)+ beta(k);
        end
    end
end
 
plot(h*(0:N-1),T);
grid on